# Numpy

In [1]:
import numpy as np

## 기초

### 배열 생성

In [8]:
# 1차원 배열 생성
arr_1d = np.array([1,2,3,4,5])
print(arr_1d.shape, arr_1d.ndim)

# 2차원 배열 생성
arr_2d = np.array([1,2,3,4,5,6]).reshape(2,3)
print(arr_2d.shape, arr_2d.ndim)

# 3차원 배열 생성
arr_3d = np.array([1,2,3,4,5,6,7,8,9,10,11,12]).reshape(2,2,3)
print(arr_3d.shape, arr_3d.ndim)

(5,) 1
(2, 3) 2
(2, 2, 3) 3

### 데이터타입 바꾸기

In [11]:
# 1차원 데이터타입 바꾸기
print(arr_1d.dtype)

arr1d_f = arr_1d.astype('float64')
print(arr1d_f, arr1d_f.dtype)

int32
[1. 2. 3. 4. 5.] float64

#### 과제1. arange, zeros, ones로 배열을 다양하게 생성하세요

In [20]:
a1 = np.arange(25)
a1

# a1으로 1,2,3차원 배열 만들기
## 1차원
ar1_1d = a1.reshape(-1)
print(ar1_1d, ar1_1d.ndim, ar1_1d.shape)

## 2차원
ar1_2d = a1.reshape(5,-1)
print(ar1_2d, ar1_2d.ndim, ar1_2d.shape)

## 3차원
ar1_3d = a1.reshape(5,5,-1)
print(ar1_3d, ar1_3d.ndim, ar1_3d.shape)

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
 24] 1 (25,)
[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [20 21 22 23 24]] 2 (5, 5)
[[[ 0]
  [ 1]
  [ 2]
  [ 3]
  [ 4]]

 [[ 5]
  [ 6]
  [ 7]
  [ 8]
  [ 9]]

 [[10]
  [11]
  [12]
  [13]
  [14]]

 [[15]
  [16]
  [17]
  [18]
  [19]]

 [[20]
  [21]
  [22]
  [23]
  [24]]] 3 (5, 5, 1)

In [57]:
#zeros
display(np.zeros_like(ar1_1d))
display(np.zeros_like(ar1_2d))
display(np.zeros_like(ar1_3d))

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0])

array([[0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0]])

array([[[0],
        [0],
        [0],
        [0],
        [0]],

       [[0],
        [0],
        [0],
        [0],
        [0]],

       [[0],
        [0],
        [0],
        [0],
        [0]],

       [[0],
        [0],
        [0],
        [0],
        [0]],

       [[0],
        [0],
        [0],
        [0],
        [0]]])

In [58]:
#ones
display(np.ones_like(ar1_1d))
display(np.ones_like(ar1_2d))
display(np.ones_like(ar1_3d))

array([1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1])

array([[1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1]])

array([[[1],
        [1],
        [1],
        [1],
        [1]],

       [[1],
        [1],
        [1],
        [1],
        [1]],

       [[1],
        [1],
        [1],
        [1],
        [1]],

       [[1],
        [1],
        [1],
        [1],
        [1]],

       [[1],
        [1],
        [1],
        [1],
        [1]]])

### 인덱싱

#### 과제2: ar1_1d, ar1_2d, ar1_3d에서 원하는 원소값들을 다양한 방식으로 인덱싱하여 출력하세요.

#### boolean indexing

In [23]:
ar1d = np.arange(1,10)
print(ar1d)

# 불린 인덱싱
ar1d[ar1d >= 6]

[1 2 3 4 5 6 7 8 9]

array([6, 7, 8, 9])

In [28]:
# 인덱스

indexes = [5,6,7,8]
ar = ar1d[indexes]
print(ar)

indexes = np.array([5,6,7,8])
ar = ar1d[indexes]
print(ar)

[6 7 8 9]
[6 7 8 9]

### 정렬

In [35]:
ar = np.array([3,1,9,5])


# 오름차순 정렬
# 방법1
print(sorted(ar))

# 방법2
print(np.sort(ar))

# 방법3(inplace = True)
ar.sort()
print(ar)

[1, 3, 5, 9]
[1 3 5 9]
[1 3 5 9]

In [36]:
# 내림차순 정렬
ar[::-1]

array([9, 5, 3, 1])

#### 과제3. ar2d를 행, 열방향으로 정렬하기

In [38]:
ar2d = np.arange(9).reshape(3,3)

# 행방향
print(np.sort(ar2d, axis = 0))

# 열방향
print(np.sort(ar2d, axis = 1))

[[0 1 2]
 [3 4 5]
 [6 7 8]]
[[0 1 2]
 [3 4 5]
 [6 7 8]]

#### 과제4. 성적 오름차순으로 이름을 출력하세요.(argsort())

In [40]:
name_array = np.array(['john', 'Mike', 'Sarah', 'Kate', 'Samuel'])

score_array = np.array([78,95,84,98,88])

In [44]:
sort_idx = np.argsort(score_array)
name_array[sort_idx]

array(['john', 'Sarah', 'Samuel', 'Mike', 'Kate'], dtype='<U6')

### 선형대수 연산: 행렬 내적

In [47]:
a = np.arange(1,7).reshape(2,3)
b = np.arange(7,13).reshape(3,2)

dot_product = np.dot(a, b)
dot_product

array([[ 58,  64],
       [139, 154]])

### 전치행렬

In [50]:
print(a)

# 방법1
a_t = a.transpose()
print(a_t)

# 방법2
a_t2 = np.transpose(a)
print(a_t2)

[[1 2 3]
 [4 5 6]]
[[1 4]
 [2 5]
 [3 6]]
[[1 4]
 [2 5]
 [3 6]]

# Pandas

In [51]:
import pandas as pd

## 기초

In [54]:
tdf = pd.read_csv('titanic_train.csv')
tdf

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [62]:
tdf.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [63]:
tdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [70]:
vcounts = tdf['Pclass'].value_counts()
vcounts

3    491
1    216
2    184
Name: Pclass, dtype: int64

#### 과제5. 데이터형태 변환

In [94]:
# 리스트, 딕셔너리, ndarray -> 데이터프레임화
## 리스트 -> 데이터프레임
li = [1,2,3,4,5]
col_name = 'number'

df1 = pd.DataFrame(li, columns = [col_name])
display(df1)


## 딕셔너리 -> 데이터프레임
dic = {'english': [100, 90, 87],
       'mathematics': [87,44,55]}
df2 = pd.DataFrame(dic)
display(df2)


## ndarray -> 데이터프레임
arr = np.array([1,3,5,7,9,11,2,4,6,8,10,12]).reshape(2,6)

df3 = pd.DataFrame(arr, index = ['홀수','짝수'], columns = ['순','서','대','로', '정','렬'])
display(df3)

   number
0       1
1       2
2       3
3       4
4       5

   english  mathematics
0      100           87
1       90           44
2       87           55

    순  서  대  로   정   렬
홀수  1  3  5  7   9  11
짝수  2  4  6  8  10  12

In [101]:
# 데이터프레임화 -> 리스트, 딕셔너리, ndarray
## 데이터프레임 -> 리스트  
li = list(df1['number'])
print(li)

## 데이터프레임 -> 딕셔너리 
dic = dict(df2)
print(dic)

## 데이터프레임 ->  ndarray
arr = np.array(df3)
print(arr)

[1, 2, 3, 4, 5]
{'english': 0    100
1     90
2     87
Name: english, dtype: int64, 'mathematics': 0    87
1    44
2    55
Name: mathematics, dtype: int64}
[[ 1  3  5  7  9 11]
 [ 2  4  6  8 10 12]]

#### 과제6. tdf를 전처리 및 탐색적 분석(시각화, 통계적 기법)을 통해 분석용 데이터셋으로 만들기

In [102]:
import pandas as pd

tdf = pd.read_csv('titanic_train.csv')
tdf

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### 사이킷런을 이용하여 붓꽃(iris)로 품종 예측하기

In [105]:
# 데이터 불러오기

In [106]:
from sklearn.datasets import load_iris

In [107]:
iris = load_iris()
iris.keys()

dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename', 'data_module'])

In [119]:
# 붓꽃 데이터셋
iris_data = iris.data

# 붓꽃 품종
iris_label = iris.target

# 붓꽃 데이터셋의 컬럼이름
iris_name = iris.feature_names

#데이터프레임화
iris_df = pd.DataFrame(iris_data, columns = iris_name)
iris_df['iris_label'] = iris.target
iris_df['iris_labelname'] = iris_df['iris_label'].replace(list(set(iris.target)), iris.target_names, regex = True)
iris_df

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),iris_label,iris_labelname
0,5.1,3.5,1.4,0.2,0,setosa
1,4.9,3.0,1.4,0.2,0,setosa
2,4.7,3.2,1.3,0.2,0,setosa
3,4.6,3.1,1.5,0.2,0,setosa
4,5.0,3.6,1.4,0.2,0,setosa
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,2,virginica
146,6.3,2.5,5.0,1.9,2,virginica
147,6.5,3.0,5.2,2.0,2,virginica
148,6.2,3.4,5.4,2.3,2,virginica
149,5.9,3.0,5.1,1.8,2,virginica

#### 과제7: idf에 대해서 학습용, 평가용 데이터를 8:2로 나누어서 분류모델링(dt) 및 정확도 평가를 수행하기

In [134]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [136]:
x = iris_df.iloc[:,:4]
y = iris_df.iloc[:,4]

# 학습용, 평가용 데이터 나누기
X_train, X_Test, y_train, y_test = train_test_split(x, y,
                                                    test_size = 0.2, random_state = 11)

# 의사결정트리로 학습, 예측 수행
dt = DecisionTreeClassifier()    # 의사결정트리 객체 생성
dt.fit(X_train, y_train)    # 학습

pred = dt.predict(X_Test)   # 예측

print(f'예측 정확도: {accuracy_score(y_test, pred):.3f}')

예측 정확도: 0.933